slides/unconverted/2013-02-22-Gini.org
* HW: Gini :slide:
  + Calculate Gini Index

* Gini Index :slide:
#+begin_src python
  Gini(D) = 1 - sum(frac**2 for frac in classes)
#+end_src
  Sum of the squares of the fraction of items in each class

* Data: Campaign Contributions :slide:
  + Calculating the Gini Index for the Candidate Names for the enitre data set
  + Partition by zip code, calculate the weighted average Gini Index score over
    all partitions
  + Partitions are weighted by the number of records they contain divided by the
    total number of records in the data set

* Extra Credit :slide:
  + Find a best split of a continuous field

* Python Tips :slide:
  + [[http://docs.python.org/2/library/collections.html][collections]]
  + =defaultdict= autovivifies keys
  + =Counter= autovivifies integer keys
#+begin_src python
zipcodes = defaultdict(Counter)
#+end_src

* Git Tips :slide:
#+begin_src bash
$ git checkout master
$ git pull jblomo master
$ git checkout -b hw-gini
#+end_src

#+STYLE: <link rel="stylesheet" type="text/css" href="production/common.css" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
#+STYLE: <link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>

#+BEGIN_HTML
<script type="text/javascript" src="production/org-html-slideshow.js"></script>
#+END_HTML

# Local Variables:
# org-export-html-style-include-default: nil
# org-export-html-style-include-scripts: nil
# buffer-file-coding-system: utf-8-unix
# End:
